//
//  tourData.swift
//  00757128_final
//
//  Created by User18 on 2020/12/13.
//
import Foundation

class travelHistory : ObservableObject {
    @Published var tourTime : Int = 0
}

struct TourAttractionStruct {
    var name : String
    var info : String
    var nearStop : String
    var passRoute : [String]
}

let tourAttractions = [TourAttractionStruct(name: "Boudouzi Station 八斗子車站", info: "來到八斗子車站就可感受海景配火車的滋味，一出站就立即看到壯觀的海景，彷彿到達另一個仙境。", nearStop: "八斗子車站", passRoute: ["103 八斗子-經中正路(經海科館)", "103 八斗子-經祥豐街(經海科館)"]),
                       TourAttractionStruct(name: "Dawulun Beach 大武崙沙灘", info: "基隆的海岸線以岩岸為主而位在澳底漁村的大武崙海灘則是少見的沙灘金黃色的柔沙、淺淺的清澈海水、綿延的群山讓它成為了基隆最迷人的沙灘！", nearStop: "大武崙沙灘", passRoute: ["305 濱海大道-大武崙沙灘(經西定路)", "305 濱海大道-大武崙沙灘(回太白莊)"]),
                       TourAttractionStruct(name: "正濱漁港", info: "正濱漁港，舊稱基隆漁港。該港為近海拖網漁業基地，曾為繁榮極盛的漁貨商港。近年來政府積極興建深水碼頭並填築新生地以期盼再造漁業榮景，並積極開發成假日休閒懷舊碼頭為目標。", nearStop: "正濱路口", passRoute: ["101 和平島-經中正路", "101 和平島-經祥豐街", "102 和平島-經祥豐街(經仁五路)"]),
                       TourAttractionStruct(name: "白米甕砲台", info: "白米甕砲台又稱荷蘭城，位於基隆港口西岸，為市定古蹟，與東岸的砲台共同來扼住港口，相傳西班牙人、荷蘭人曾於此建城堡，礮台的創建年代在清法戰爭時，但以現今所見之建築，應為日治時代日軍因應日俄戰爭所改建，清領時期以來的歷次對外戰爭，佔有舉足輕重的地位。", nearStop: "太白莊", passRoute: ["301 太白莊-經中山一路","301 太白莊-經成功市場","301 太白莊-經高遠新村","302 中山高中-經西定路","302 中山高中-經成功市場","305 濱海大道-大武崙沙灘(回太白莊)"]),
                       TourAttractionStruct(name: "和平島公園", info: "和平島公園位於基隆港港口東側，島上奇岩異石林立，海岸奇特的海蝕地形景觀，如海蝕平臺、豆腐岩、海蝕溝、海蝕崖、風化窗、萬人堆、千疊敷、海蝕洞、蕈狀岩等。", nearStop: "和平島公園", passRoute: ["101 和平島-經中正路","101 和平島-經祥豐街","102 和平島-經祥豐街(經仁五路)"/*,"T99 台灣好行-濱海奇基"*/]),
                       TourAttractionStruct(name: "社寮東砲台", info: "本砲台的配置方式採用抱山式的做法，利用山谷坳地將營舍配置其間，隱藏性高，而砲座位於山頭，從外海很難發現砲台的存在。社寮東砲台是自清領末期，日治時期起，為基隆地區的軍事要塞，具高度的保存價值。", nearStop: "和平橋頭(原民會館)", passRoute: ["101 和平島-經中正路", "101 和平島-經祥豐街", "102 和平島-經祥豐街(經仁五路)"]),
                       TourAttractionStruct(name: "長潭漁港", info: "長潭里漁港為基隆市七個漁港之一與望海巷漁港相距不遠。過去八斗子是一個島嶼，島與陸地間是一個狹長的水道，稱為「長潭」。", nearStop: "海科館(碧水巷)(返)", passRoute: ["103 八斗子-經中正路(經海科館)", "103 八斗子-經祥豐街(經海科館)"]),
                       TourAttractionStruct(name: "外木山情人湖濱海大道", info: "外木山海岸為基隆市轄區僅存最長的天然海岸。自外木山漁港至澳底通村全長約5公里的海岸公路。一側為開闊的海岸景觀，一側為高聳的單面山懸崖，是極富壯麗景色的海岸線。", nearStop: "情人湖濱海大道紀念碑", passRoute: ["305 濱海大道-大武崙沙灘(經西定路)","305 濱海大道-大武崙沙灘(回太白莊)","310 濱海大道-大武崙沙灘"]),
                       TourAttractionStruct(name: "獅球嶺觀景台", info: "獅球嶺觀景台可以俯看基隆市區及基隆港全景，居高臨下視野極佳，是很多攝影愛好者拍照秘境。白天可以看到高速公路一直到基隆嶼，晚間也可拍夕陽、夜景，附近有古蹟獅球嶺砲台及充滿綠蔭的健康步道，是拍照、踏青好去處。", nearStop: "成功市場", passRoute: ["501 國家新城-經長庚醫院(經麥金路)","502 建德國中-經成功市場(經安樂路)"]),
                       TourAttractionStruct(name: "廟口夜市", info: "基隆廟口是位於臺灣基隆市仁愛區的小吃市集，以仁三路上的奠濟宮為中心聚集，是全臺灣最著名的夜市之一。全天24小時皆有店家在此營業，每到晚間夜市時段時更為熱鬧，所以也稱為廟口夜市，當地人口中所說的「廟口」指的就是這個地方。", nearStop: "仁二路(二信循環站)", passRoute: ["501 國家新城-經長庚醫院(經麥金路)","502 建德國中-經成功市場(經安樂路)"]),
                       TourAttractionStruct(name: "潮境公園", info: "潮境公園潮境公園位於八斗子半島東側，園區原為一處垃圾的集放地，經海洋科技博物館籌備處規劃改建後，後成為一處看海賞景的最佳去處。園區內設有規劃完善的枕木步道，還有許多藝術雕塑品。除此之外，更為欣賞美麗的海景、基隆山、九份的絕佳地點。", nearStop: "海科館(碧水巷)(返)", passRoute: ["103 八斗子-經中正路(經海科館)", "103 八斗子-經祥豐街(經海科館)"])]
